# 6.2

a = ["Васильева","Вишневская","Шляхтенко","Солдатенко","Степанова","Безуглова","Калинина","Деревицкий","Коробков","Лаптев"]
b = ["Суханов","Иванов","Петрова","Сафронов","Мирошников","Гедзь","Абаев","Аристов","Воликов","Мытникова"]

c = tuple(a[:5] + b[:5])

print(f"Исходный список 1: {a}")
print(f"Исходный список 2: {b}")
print(f"Полученный кортеж: {c}")
print(f"Длина кортежа: {len(c)}")
print(f"Отсортированный кортеж: {sorted(c)}")
if "Иванов" in c:
    print("Иванов есть в кортеже")
    print(f"Иванов встречается {c.count('Иванов')} раз(а)")
else: print("Иванова нет в кортеже")
